// html标签匹配
const str = `<p><span>结结实实还是@无名小姐 誓师大会#互助问答# 很多dsajkdj 话不哥哥哥哥哥哥哥哥哥哥多不方便记得记得亟待解决大家大家的吧\n就睡觉睡觉睡觉今生今世就是觉得很多话亟待解决的记得记得记得亟待解决的记得记得记得记得记得就</span></p>
<p><span>睡觉今生今世今生今世嫁鸡随鸡@文琪1980 睡觉睡觉</span></p>
<p><span>觉得就是嫁鸡随鸡</span></p>`

const pattern = /<p><span>([\s\S]*?)<\/span><\/p>/g
console.log(str.match(pattern).length);

// [
//     '<p><span>结结实实还是@无名小姐 誓师大会#互助问答# 很多dsajkdj 话不哥哥哥哥哥哥哥哥哥哥多不方便记得记得亟待解决大家大家的吧\n' +
//       '就睡觉睡觉睡觉今生今世就是觉得很多话亟待解决的记得记得记得亟待解决的记得记得记得记得记得就</span></p>',
//     '<p><span>睡觉今生今世今生今世嫁鸡随鸡@文琪1980 睡觉睡觉</span></p>',
//     '<p><span>觉得就是嫁鸡随鸡</span></p>'
//   ]